In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('marks.csv',header=None, names=['name','subject','marks'])

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     9 non-null      object
 1   subject  8 non-null      object
 2   marks    8 non-null      float64
dtypes: float64(1), object(2)
memory usage: 344.0+ bytes

In [4]:
df['subject'].value_counts()

Java      3
Python    2
C         1
HTML      1
Name: subject, dtype: int64

In [5]:
df.size

21

In [6]:
df.shape

(7, 3)

In [7]:
df.values

array([['Bill', 'Java', 90],
       ['Bill', 'Python', 95],
       ['Steve', 'Java', 80],
       ['Steve', 'C', 90],
       ['Roberts', 'HTML', 98],
       ['Roberts', 'Java', 60],
       ['Roberts', 'Python', 70]], dtype=object)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     7 non-null      object
 1   subject  7 non-null      object
 2   marks    7 non-null      int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [9]:
df.columns

Index(['name', 'subject', 'marks'], dtype='object')

In [10]:
# df.columns= ['Name','Subject','Marks']

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     9 non-null      object
 1   subject  8 non-null      object
 2   marks    8 non-null      float64
dtypes: float64(1), object(2)
memory usage: 344.0+ bytes

In [21]:
df.describe(include='all')

         name subject    marks
count       9       8   8.0000
unique      4       4      NaN
top     Steve  Python      NaN
freq        3       3      NaN
mean      NaN     NaN  80.3750
std       NaN     NaN  15.3431
min       NaN     NaN  60.0000
25%       NaN     NaN  67.5000
50%       NaN     NaN  85.0000
75%       NaN     NaN  91.2500
max       NaN     NaN  98.0000

In [22]:
df.describe()

         marks
count   8.0000
mean   80.3750
std    15.3431
min    60.0000
25%    67.5000
50%    85.0000
75%    91.2500
max    98.0000

In [24]:
# marks = pd.read_excel(r"c:\classroom\apr6ds\marks.xls","marks")

### retrieving data

In [26]:
df.at[0,'marks'], df.iat[0,2]

(90.0, 90.0)

In [27]:
# get rows related to python and java
df[df.subject.isin(['Python','Java'])]

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN

In [28]:
df.where( df.marks > 80)

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2      NaN     NaN    NaN
3    Steve       C   90.0
4  Roberts    HTML   98.0
5      NaN     NaN    NaN
6      NaN     NaN    NaN
7      NaN     NaN    NaN
8      NaN     NaN    NaN

In [29]:
df[ df.marks > 80]

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
3    Steve       C   90.0
4  Roberts    HTML   98.0

In [30]:
df[:3]

    name subject  marks
0   Bill    Java   90.0
1   Bill  Python   95.0
2  Steve    Java   80.0

In [35]:
df.iloc[:, :2]

      name subject
0     Bill    Java
1     Bill  Python
2    Steve    Java
3    Steve       C
4  Roberts    HTML
5  Roberts    Java
6  Roberts  Python
7    Steve  Python
8    Henry     NaN

In [36]:
df.loc[:, :'subject']

      name subject
0     Bill    Java
1     Bill  Python
2    Steve    Java
3    Steve       C
4  Roberts    HTML
5  Roberts    Java
6  Roberts  Python
7    Steve  Python
8    Henry     NaN

#### apply() and applymap()

In [8]:
df.apply(lambda s : s.notnull().sum())

name       9
subject    8
marks      8
dtype: int64

In [9]:
df.apply(lambda s : s.notnull().sum(), axis=1)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
7    2
8    2
dtype: int64

In [13]:
df[['name','subject']].applymap(lambda v : len(str(v)))

   name  subject
0     4        4
1     4        6
2     5        4
3     5        1
4     7        4
5     7        4
6     7        6
7     5        6
8     5        3

#### Adding rows

In [21]:
df = df.append({'name':'Mark','subject':'Java', 'marks':90}, ignore_index=True)

In [24]:
df.loc[11] = ['Mark','Python',88]

In [28]:
df.drop(11, inplace=True)

In [29]:
df['passmark'] = 50

In [31]:
df.loc[ df.subject == 'Python', 'passmark'] = 60

In [33]:
df.at[7,'marks'] > 60

False

In [34]:
df

      name subject  marks  passmark
0     Bill    Java   90.0        50
1     Bill  Python   95.0        60
2    Steve    Java   80.0        50
3    Steve       C   90.0        50
4  Roberts    HTML   98.0        50
5  Roberts    Java   60.0        50
6  Roberts  Python   70.0        60
7    Steve  Python    NaN        60
8    Henry     NaN   60.0        50
9     Mark    Java   90.0        50

In [10]:
df.sort_values(by='marks', ascending=False).head()

      name subject  marks
4  Roberts    HTML   98.0
1     Bill  Python   95.0
0     Bill    Java   90.0
3    Steve       C   90.0
2    Steve    Java   80.0

In [11]:
students = pd.DataFrame( {'rollno' : np.arange(1,11), 'name' : ['name' + str(i) for i in range(1,11)]})

In [17]:
students.sort_index(ascending=False)

   rollno    name
9      10  name10
8       9   name9
7       8   name8
6       7   name7
5       6   name6
4       5   name5
3       4   name4
2       3   name3
1       2   name2
0       1   name1

In [18]:
students.rename( columns = {'rollno': 'admno'})

   admno    name
0      1   name1
1      2   name2
2      3   name3
3      4   name4
4      5   name5
5      6   name6
6      7   name7
7      8   name8
8      9   name9
9     10  name10

In [4]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [7]:
df[['subject']].duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7     True
8    False
dtype: bool

In [8]:
df['subject'].nunique()

4

In [9]:
df

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
8    Henry     NaN   60.0

In [14]:
df.dropna(how='all')

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
8    Henry     NaN   60.0

In [17]:
df.fillna({'subject': 'none', 'marks':-1}, inplace=True)

In [24]:
df

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python   -1.0
8    Henry    none   60.0

In [28]:
df.replace({'subject' :'none', 'marks': -1}, np.nan, inplace=True)

In [30]:
df.fillna({'marks' : df['marks'].mean()})

      name subject   marks
0     Bill    Java  90.000
1     Bill  Python  95.000
2    Steve    Java  80.000
3    Steve       C  90.000
4  Roberts    HTML  98.000
5  Roberts    Java  60.000
6  Roberts  Python  70.000
7    Steve  Python  80.375
8    Henry     NaN  60.000

In [39]:
 df.loc[df.isna().any(axis=1),:]

    name subject  marks
7  Steve  Python    NaN
8  Henry     NaN   60.0

In [42]:
 df.loc[:,df.isna().all()]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8]

In [41]:
df.isna().any()

name       False
subject     True
marks       True
dtype: bool

In [5]:
df['marks'].astype('float64')

0    90.0
1    95.0
2    80.0
3    90.0
4    98.0
5    60.0
6    70.0
7     NaN
8    60.0
Name: marks, dtype: float64

In [6]:
df2 = df.dropna()

In [7]:
df2

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0

In [8]:
df2['marks'].astype('int32')

0    90
1    95
2    80
3    90
4    98
5    60
6    70
Name: marks, dtype: int32

In [10]:
df.to_json("marks.json", orient="records")

In [13]:
df.to_csv("final_marks.csv", index = False)

### binning

In [16]:
pd.cut( df['marks'],3)

0      (85.333, 98.0]
1      (85.333, 98.0]
2    (72.667, 85.333]
3      (85.333, 98.0]
4      (85.333, 98.0]
5    (59.962, 72.667]
6    (59.962, 72.667]
7                 NaN
8    (59.962, 72.667]
Name: marks, dtype: category
Categories (3, interval[float64]): [(59.962, 72.667] < (72.667, 85.333] < (85.333, 98.0]]

In [20]:
pd.cut( df['marks'],bins=[50,70,85,100], labels=['C','B','A'])

0      A
1      A
2      B
3      A
4      A
5      C
6      C
7    NaN
8      C
Name: marks, dtype: category
Categories (3, object): [C < B < A]

In [21]:
pd.qcut( df['marks'], 4)

0     (85.0, 91.25]
1     (91.25, 98.0]
2      (67.5, 85.0]
3     (85.0, 91.25]
4     (91.25, 98.0]
5    (59.999, 67.5]
6      (67.5, 85.0]
7               NaN
8    (59.999, 67.5]
Name: marks, dtype: category
Categories (4, interval[float64]): [(59.999, 67.5] < (67.5, 85.0] < (85.0, 91.25] < (91.25, 98.0]]

In [27]:
print(df['marks'])
pd.qcut( df['marks'], q=[0,.50,.75,1.0], precision=0)

0    90.0
1    95.0
2    80.0
3    90.0
4    98.0
5    60.0
6    70.0
7     NaN
8    60.0
Name: marks, dtype: float64

0    (85.0, 91.0]
1    (91.0, 98.0]
2    (59.0, 85.0]
3    (85.0, 91.0]
4    (91.0, 98.0]
5    (59.0, 85.0]
6    (59.0, 85.0]
7             NaN
8    (59.0, 85.0]
Name: marks, dtype: category
Categories (3, interval[float64]): [(59.0, 85.0] < (85.0, 91.0] < (91.0, 98.0]]